; domain
(define
  (domain BLOCKS)
  (:requirements :strips :typing :equality)
  (:types block)
  (:constants S T A R H C U K - block)
  (:predicates (on ?x ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block) (obs_0) (obs_1))
  (:action pick-up :parameters (?x - block) :precondition (and (clear ?x) (ontable ?x) (handempty)) :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))
  (:action put-down :parameters (?x - block) :precondition (holding ?x) :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))
  (:action stack :parameters (?x ?y - block) :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y))) :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))
  (:action unstack :parameters (?x ?y - block) :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y))) :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))
  (:action unstack__obs1 :parameters () :precondition (and (on s a) (clear s) (handempty) (not (= s a)) (obs_0)) :effect (and (holding s) (clear a) (not (clear s)) (not (handempty)) (not (on s a)) (obs_1)))
)

; problem
(define (problem blocks_words)
(:domain blocks)
(:objects

M O T H E R W A - block
)
(:init
(HANDEMPTY)
(CLEAR M)
(ON M O)
(ONTABLE O)
(CLEAR E)
(ONTABLE E)
(CLEAR T)
(ON T W)
(ONTABLE W)
(CLEAR H)
(ONTABLE H)
(CLEAR R)
(ON R A)
(ONTABLE A)
)
(:goal (and
(CLEAR H)
(ONTABLE O)
(ON H E)
(ON E R)
(ON R O)
))
)

; plan
1. (unstack m o)
   deleted: (clear m) (handempty) (on m o)
   added: (holding m) (clear o)
   goals met: 2 of 5
2. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 2 of 5
3. (unstack r a)
   deleted: (clear r) (handempty) (on r a)
   added: (holding r) (clear a)
   goals met: 2 of 5
4. (stack r o)
   deleted: (holding r) (clear o)
   added: (clear r) (handempty) (on r o)
   goals met: 3 of 5
5. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 3 of 5
6. (stack e r)
   deleted: (holding e) (clear r)
   added: (clear e) (handempty) (on e r)
   goals met: 4 of 5
7. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 3 of 5
8. (stack h e)
   deleted: (holding h) (clear e)
   added: (clear h) (handempty) (on h e)
   goals met: 5 of 5
